load-test-heavy.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 300 # Chạy trong 5 phút
      arrivalRate: 2
      rampTo: 10
      name: "Giai đoạn tích lũy 500+ User"
  engines:
    socketio:
      transports: ["websocket"]
      query:
        token: "final-report-{{ $uuid }}"

scenarios:
  - name: "Duy trì kết nối ổn định"
    engine: socketio
    flow:
      - emit:
          channel: "join_room"
          data: { "roomId": "room_final" }

      # Thay vì đứng im (think), robot sẽ gửi tin nhắn "Keep-alive"
      # Điều này giúp socket không bị rơi vào trạng thái Timeout của Windows
      - loop:
          - emit:
              channel: "send_message"
              data:
                senderId: "bot-{{ $uuid }}"
                content: "ping"
          - think: 5 # 5 giây gửi 1 lần là con số an toàn nhất
        count: 100 # Ở lại đủ lâu để tích lũy số lượng User lớn