load-test.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: "Giai đoạn tải ổn định"
  engines:
    socketio:
      transports: ["websocket"] # Ưu tiên kết nối WebSocket theo đặc tả [cite: 177]

scenarios:
  - name: "User tham gia phòng và gửi tin nhắn đa phương tiện"
    engine: socketio
    flow:
      # Bước 1: Tham gia phòng (Sử dụng ID mẫu khớp với logic index.js) [cite: 359]
      - emit:
          channel: "join_room"
          data: { "roomId": "65f4a1b2c3d4e5f6a7b8c9d0" }
      - think: 1

      # Bước 2: Gửi tin nhắn văn bản (Trường dữ liệu là 'content' và 'senderId')
      - emit:
          channel: "send_message"
          data:
            senderId: "bot-user-{{ $uuid }}"
            content: "Chào mọi người, tôi đang test hiệu năng hệ thống!"
      - think: 2

      # Bước 3: Gửi tin nhắn chứa ảnh (Đúng định dạng mediaUrl và fileName PascalCase)
      - emit:
          channel: "send_message"
          data:
            senderId: "bot-user-{{ $uuid }}"
            content: ""
            mediaUrl: "http://localhost:9000/chat-uploads/HoTaDung.jpg"
            fileName: "HoTaDung.jpg"
      - think: 1